gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
/****************************************************************************
 * arch/renesas/src/ra6m5/ra6m5_iic.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/kthread.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>

#include <arch/board/board.h>

#include "ra6m5_iic.h"
#include "ra6m5_rcc.h"
#include "ra6m5_gpio.h"


/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if defined(CONFIG_RA6M5_IIC0) || defined(CONFIG_RA6M5_IIC1) || \
    defined(CONFIG_RA6M5_IIC2)

#define BUS_CHECK_COUNTER         (1000)
#define RIIC_REG_INIT             (0x00)
#define RIIC_BUS_BUSY             ((bool)(1))
#define RIIC_BUS_FREE             ((bool)(0))
#define RIIC_10BIT_SARU_MASK      (0x0300)
#define RIIC_10BIT_SARL_MASK      (0x00ff)
#define RIIC_I2C_SLV_ADDR         (0x80)
#define RIIC_READ_MASK            (0x01)

/****************************************************************************
 * Typedef definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum ra6m5_i2c_mode_e
{
  RIIC_NONE = 0,              /* Uninitialized state */
  RIIC_READY,                 /* Ready for operation */
  RIIC_M_TRANSMIT,            /* Master transmission mode */
  RIIC_M_RECEIVE,             /* Master reception mode */
  RIIC_FINISH,                /* Successful operation */
};

enum ra6m5_i2c_dev_sts_e
{
  RIIC_STS_NO_INIT = 0,        /* None initialization state */
  RIIC_STS_IDLE,               /* Idle state */
  RIIC_STS_ST_COND_WAIT,       /* Start condition generation completion wait state */
  RIIC_STS_SEND_SLVADR_W_WAIT, /* Slave address [Write] transmission completion wait state */
  RIIC_STS_SEND_SLVADR_R_WAIT, /* Slave address [Read] transmission completion wait state */
  RIIC_STS_SEND_DATA_WAIT,     /* Data transmission completion wait state */
  RIIC_STS_RECEIVE_DATA_WAIT,  /* Data reception completion wait state */
  RIIC_STS_SP_COND_WAIT,       /* Stop condition generation completion wait state */
  RIIC_STS_AL,                 /* Detect Arbitration Lost */
  RIIC_STS_TMO,                /* Detect Time out */
  RIIC_STS_MAX,                /* Prohibition of setup above here */
};

enum ra6m5_i2c_event_e
{
  RIIC_EV_NONE = 0,
  RIIC_EV_GEN_START_COND,     /* Called function of Start condition generation */
  RIIC_EV_INT_START,          /* Interrupted start codition generation */
  RIIC_EV_INT_ADD,            /* Interrupted address sending */
  RIIC_EV_INT_SEND,           /* Interrupted data sending */
  RIIC_EV_INT_RECEIVE,        /* Interrupted data receiving */
  RIIC_EV_INT_STOP,           /* Interrupted Stop condition generation */
  RIIC_EV_INT_AL,             /* Interrupted Arbitration-Lost */
  RIIC_EV_INT_NACK,           /* Interrupted No Acknowledge */
  RIIC_EV_INT_TXI,            /* Interrupted transmitted buffer empty */
  RIIC_EV_INT_TMO,            /* Interrupted Time out */
  RIIC_EV_MAX,                /* Prohibition of setup above here */
};

struct ra6m5_i2c_dev_s
{
  uint32_t  base;             /* Base address of registers */
  uint32_t  frequency;        /* Configured kbps */
  uint8_t   txi_irq;          /* TXI IRQ Number */
  uint8_t   rxi_irq;          /* RXI IRQ Number */
  uint8_t   tei_irq;          /* TEI IRQ Number */
  uint8_t   eri_irq;          /* ERI IRQ Number */
  uint32_t  scl_pin;          /* GPIO configuration for SCL as SCL */
  uint32_t  sda_pin;          /* GPIO configuration for SDA as SDA */
};

struct ra6m5_i2c_priv_s
{
  const struct      i2c_ops_s *ops;
  const struct      ra6m5_i2c_dev_s *dev;
  int               refs;            /* Referernce count */
  int               bus;             /* Bus number */
  volatile uint8_t  mode;            /* See enum ra6m5_i2c_mode_e */
  volatile uint8_t  dev_sts;         /* See enum ra6m5_i2c_dev_sts_e */
  volatile uint8_t  event;           /* See enum ra6m5_i2c_event_e */
  mutex_t           lock;            /* Mutual exclusion mutex */
  sem_t             sem_isr;         /* Interrupt wait semaphore */
  uint8_t           msgc;            /* Number of Messages */
  struct            i2c_msg_s *msgv; /* Message list */
  uint8_t           *ptr;            /* Current message buffer */
  int               dcnt;            /* Bytes remaining to transfer */
  uint16_t          flags;           /* Current message flags */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int ra6m5_iic_iicrst(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_setclock(struct ra6m5_i2c_priv_s *priv,
                                uint32_t frequency);
static void ra6m5_iic_init(struct ra6m5_i2c_priv_s *priv);
static int ra6m5_iic_startcond(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_restartcond(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_send_slv_addr(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_after_send_slvadr(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_master_transmit(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_master_receive(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_stopcond(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_advance(struct ra6m5_i2c_priv_s *priv);
static uint8_t ra6m5_iic_read_data(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_wait_set(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_pre_end_set(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_end_set(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_nack(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_set_sending_data(struct ra6m5_i2c_priv_s *priv,
                                        uint8_t data);
static int ra6m5_iic_after_stop(struct ra6m5_i2c_priv_s *priv);
static bool ra6m5_iic_check_bus_busy(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_set_icier(struct ra6m5_i2c_priv_s *priv,
                                 uint8_t value);
static void ra6m5_iic_timeout(struct ra6m5_i2c_priv_s *priv);

/* RIIC Interrupt Handling */

static void ra6m5_iic_int_disable(struct ra6m5_i2c_priv_s *priv);
static void ra6m5_iic_int_enable(struct ra6m5_i2c_priv_s *priv);
static int ra6m5_iic_irq_init(struct ra6m5_i2c_priv_s *priv);

/*  Interrupt Handling */

