gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
static int ra6m5_iic_rxi_isr(int irq, void *context, void *arg);
static int ra6m5_iic_txi_isr(int irq, void *context, void *arg);
static int ra6m5_iic_eri_isr(int irq, void *context, void *arg);
static int ra6m5_iic_tei_isr(int irq, void *context, void *arg);

/* I2C operations */

static int ra6m5_i2c_transfer(struct i2c_master_s *dev,
                              struct i2c_msg_s *msgs, int count);
#ifdef CONFIG_I2C_RESET
static int ra6m5_i2c_reset(struct i2c_master_s *dev);
#endif

/****************************************************************************
 * Private Macros
 ****************************************************************************/

#define RA6M5_IIC_STOP(n)       (1 << (7 + (2-(n))))

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

void up_enable_irq(int irq);
void up_disable_irq(int irq);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Device Structures, Instantiation */

static const struct i2c_ops_s ra6m5_i2c_ops =
{
  .transfer = ra6m5_i2c_transfer
#ifdef CONFIG_I2C_RESET
  , .reset  = ra6m5_i2c_reset
#endif
};

#ifdef CONFIG_RA6M5_IIC0
static const struct ra6m5_i2c_dev_s ra6m5_iic0_dev =
{
  .base       = RA6M5_I2C0_BASE,
  .frequency  = CONFIG_RA6M5_IIC0_BITRATE,
#ifndef CONFIG_I2C_POLLED
  .txi_irq    = RA6M5_IRQ_IIC0_TXI,
  .rxi_irq    = RA6M5_IRQ_IIC0_RXI,
  .tei_irq    = RA6M5_IRQ_IIC0_TEI,
  .eri_irq    = RA6M5_IRQ_IIC0_ERI,
#endif
  .scl_pin    = GPIO_IIC0_SCL,
  .sda_pin    = GPIO_IIC0_SDA,
};

static struct ra6m5_i2c_priv_s ra6m5_iic0_priv =
{
  .ops       = &ra6m5_i2c_ops,
  .dev       = &ra6m5_iic0_dev,
  .refs      = 0,
  .bus       = 0,
  .lock      = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr   = SEM_INITIALIZER(0),
#endif
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif

#ifdef CONFIG_RA6M5_IIC1
static const struct ra6m5_i2c_dev_s ra6m5_iic1_dev =
{
  .base      = RA6M5_I2C1_BASE,
  .frequency = CONFIG_RA6M5_IIC1_BITRATE,
#ifndef CONFIG_I2C_POLLED
  .txi_irq    = RA6M5_IRQ_IIC1_TXI,
  .rxi_irq    = RA6M5_IRQ_IIC1_RXI,
  .tei_irq    = RA6M5_IRQ_IIC1_TEI,
  .eri_irq    = RA6M5_IRQ_IIC1_ERI,
#endif
  .scl_pin    = GPIO_IIC1_SCL,
  .sda_pin    = GPIO_IIC1_SDA,
};

static struct ra6m5_i2c_priv_s ra6m5_iic1_priv =
{
  .ops       = &ra6m5_i2c_ops,
  .dev       = &ra6m5_iic1_dev,
  .refs      = 0,
  .bus       = 1,
  .lock      = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr   = SEM_INITIALIZER(0),
#endif
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif

#ifdef CONFIG_RA6M5_IIC2
static const struct ra6m5_i2c_dev_s ra6m5_iic2_dev =
{
  .base      = RA6M5_I2C2_BASE,
  .frequency = CONFIG_RA6M5_IIC2_BITRATE,
#ifndef CONFIG_I2C_POLLED
  .txi_irq    = RA6M5_IRQ_IIC2_TXI,
  .rxi_irq    = RA6M5_IRQ_IIC2_RXI,
  .tei_irq    = RA6M5_IRQ_IIC2_TEI,
  .eri_irq    = RA6M5_IRQ_IIC2_ERI,
#endif
  .scl_pin    = GPIO_IIC2_SCL,
  .sda_pin    = GPIO_IIC2_SDA,
};

static struct ra6m5_i2c_priv_s ra6m5_iic2_priv =
{
  .ops       = &ra6m5_i2c_ops,
  .dev       = &ra6m5_iic2_dev,
  .refs      = 0,
  .bus       = 2,
  .lock      = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr   = SEM_INITIALIZER(0),
#endif
  .mode      = RIIC_NONE,
  .dev_sts   = RIIC_STS_NO_INIT,
  .event     = RIIC_EV_NONE,
  .msgc      = 0,
  .msgv      = NULL,
  .ptr       = NULL,
  .dcnt      = 0,
  .flags     = 0,
};
#endif


/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5_riic_getreg
 *
 * Description:
 *   Get a 8-bit register value by offset
 *
 ****************************************************************************/

static inline uint8_t ra6m5_riic_getreg(struct ra6m5_i2c_priv_s *priv,
                                        uint32_t offset)
{
  return getreg8(priv->dev->base + offset);
}

/****************************************************************************
 * Name: ra6m5_riic_putreg
 *
 * Description:
 *  Put a 8-bit register value by offset
 *
 ****************************************************************************/

static inline void ra6m5_riic_putreg(struct ra6m5_i2c_priv_s *priv,
                                    uint32_t offset, uint8_t value)
{
  putreg8(value, priv->dev->base + offset);
}

/****************************************************************************
 * Name: ra6m5_riic_modifyreg
 *
 * Description:
 *   Modify a 8-bit register value by offset
 *
 ****************************************************************************/

static inline void ra6m5_riic_modifyreg(struct ra6m5_i2c_priv_s *priv,
                                       uint32_t offset, uint8_t clearbits,
                                       uint8_t setbits)
{
  modifyreg8(priv->dev->base + offset, clearbits, setbits);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5_iic_iicrst
 *
 * Description:
 *   Disable writing to registers
 ****************************************************************************/

static int ra6m5_iic_iicrst(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;

  /* Assert the bus reset */
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval |= IIC_ICCR1_IICRST;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);

