gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  /* Release the bus reset */
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval &= ~(IIC_ICCR1_IICRST);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);

  return OK;
}

/****************************************************************************
 * Name: ra6m5_iic_set_icier
 *
 * Description:
 *   Sets interrupt enable register ICIER for RIIC communication
 *
 ****************************************************************************/

static void ra6m5_iic_set_icier(struct ra6m5_i2c_priv_s *priv,
                                 uint8_t value)
{
  uint8_t regval;
  regval = (value | IIC_ICIER_TMOIE);

  ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, regval);
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET);
}

/****************************************************************************
 * Name: ra6m5_iic_setclock
 *
 * Description:
 *   Sets the I2C bus clock frequency – frequency for the transfer
 *
 ****************************************************************************/

static void ra6m5_iic_setclock(struct ra6m5_i2c_priv_s *priv,
                                uint32_t frequency)
{
  /* Divider array of RIIC clock  */

  uint8_t regval;
  const uint8_t d_cks[RIIC_MAX_DIV] =
    { 1, 2, 4, 8, 16, 32, 64, 128
    };

  volatile double l_time;     /* L Width period */
  volatile double h_time;     /* H Width period */
  volatile double calc_val;   /* Using for Calculation */
  double calc_val_tmp;
  volatile uint8_t cnt;

  /* Calculation of L width time */

  l_time = (1.0 / (2.0 * frequency)); /* Half period of frequency */
  h_time = l_time;

  /* Check I2C mode of Speed */

  if (frequency > I2C_SPEED_FAST)
    {
      i2cinfo("Fast Plus Mode Selected - Transmission Rate: 1 Mbps\n");
      if (l_time < 0.5E-6)
        {
          /* Wnen L width less than 0.5us, subtract Rise up and down
           * time for SCL from H/L width
           */

          l_time = 0.5E-6;
          h_time = (((1.0 / frequency) - l_time) - SCL_RISE_TIME_FASTPLUS)
                 - SCL_FALL_TIME_FASTPLUS;
        }

      else
        {
          /* Subtract Rise up and down time for SCL from H/L width */

          l_time -= SCL_FALL_TIME_FASTPLUS;
          h_time -= SCL_RISE_TIME_FASTPLUS;
        }
    }

  else if (frequency > I2C_SPEED_STANDARD)
    {
      i2cinfo("Fast Mode Selected - Transmission Rate: 400 kbps\n");
      if (l_time < 1.3E-6)
        {
          /* Wnen L width less than 1.3us, subtract Rise up and down
           * time for SCL from H/L width
           */

          l_time = 1.3E-6;
          h_time = (((1.0 / frequency) - l_time) - SCL_RISE_TIME_FAST)
                    - SCL_FALL_TIME_FAST;
        }

      else
        {
          /* Subtract Rise up and down time for SCL from H/L width */

          l_time -= SCL_FALL_TIME_FAST;
          h_time -= SCL_RISE_TIME_FAST;
        }
    }

  else
    {
      i2cinfo("Standard Mode Selected - Transmission Rate: 100 kbps\n");

      /* Subtract Rise up and down time for SCL from H/L width */

      l_time -= SCL_FALL_TIME_STANDARD;
      h_time -= SCL_RISE_TIME_STANDARD;
    }

  /* Calculate ICBRL value */

  for (calc_val = RIIC_RATE_CALC, cnt = 0; RIIC_CALC_MAX < calc_val; cnt++)
    {
      calc_val = l_time; /* Set L width time */

      /* Check the range of divider of CKS */

      if (cnt >= RIIC_MAX_DIV)
        {
          /* Cannot set bps */
        }

      calc_val_tmp = calc_val;

      /* Calculation of ICBRL value */

      calc_val = (calc_val_tmp / (d_cks[cnt] / (double)g_clock_freq[RA6M5_CLOCKS_SOURCE_PCLKB]));
      calc_val = calc_val + 0.5; /* round off */
    }

  /* Set ICMR1.CKS bits. */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR1_OFFSET);
  regval &= IIC_ICMR1_CKS_MASK;
  regval |= IIC_ICMR1_CKS(cnt);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR1_OFFSET, regval);

  /* Set value to ICBRL register */

  regval = (uint8_t)((uint8_t)(calc_val - 1) | RIIC_ICBRL_MASK);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICBRL_OFFSET, regval);

  /* Calculate ICBRH value */

  calc_val = h_time;
  calc_val_tmp = calc_val;

  /* Calculation ICBRH value */

  calc_val = (calc_val_tmp / (d_cks[cnt - 1] / (double)g_clock_freq[RA6M5_CLOCKS_SOURCE_PCLKB]));
  calc_val = (uint8_t)(calc_val + 0.5); /* Round off */

  /* If the calculated value is less than 1, it rounded up to 1. */

  if (1 > calc_val)
    {
      calc_val = 1;
    }

  /* Set value to ICBRH register */

  regval = (uint8_t)((uint8_t)(calc_val - 1) | RIIC_ICBRH_MASK);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICBRH_OFFSET, regval);
}

/****************************************************************************
 * Name: ra6m5_iic_int_enable
 *
 * Description:
 *   Enable Interrupts
 *
 ****************************************************************************/

static void ra6m5_iic_int_enable(struct ra6m5_i2c_priv_s *priv)
{
  up_enable_irq(priv->dev->txi_irq);
  up_enable_irq(priv->dev->rxi_irq);
  up_enable_irq(priv->dev->tei_irq);
  up_enable_irq(priv->dev->eri_irq);
}

/****************************************************************************
 * Name: ra6m5_iic_int_disable
 *
 * Description:
 *   Disable Interrupts
 *
 ****************************************************************************/

static void ra6m5_iic_int_disable(struct ra6m5_i2c_priv_s *priv)
{
  up_disable_irq(priv->dev->txi_irq);
  up_disable_irq(priv->dev->rxi_irq);
  up_disable_irq(priv->dev->tei_irq);
  up_disable_irq(priv->dev->eri_irq);
}

/****************************************************************************
 * Name: ra6m5_iic_irq_init
 *
 * Description:
 *   Setup the initial conditions of I2C interrupt handling
 *
 ****************************************************************************/

static int ra6m5_iic_irq_init(struct ra6m5_i2c_priv_s *priv)
{
  int ret;

  ret = irq_attach(priv->dev->rxi_irq, ra6m5_iic_rxi_isr, priv);
  ret = irq_attach(priv->dev->txi_irq, ra6m5_iic_txi_isr, priv);
  ret = irq_attach(priv->dev->tei_irq, ra6m5_iic_tei_isr, priv);
  ret = irq_attach(priv->dev->eri_irq, ra6m5_iic_eri_isr, priv);

