gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  ra6m5_iic_int_enable(priv);

  return ret;
}

/****************************************************************************
 * Name: ra6m5_iic_init
 *
 * Description:
 *   Setup the initial conditions of I2C hardware and be ready for operation
 *
 ****************************************************************************/

static void ra6m5_iic_init(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;

  /* Disable RXI, TXI, TEI and ERI interrupts */

  ra6m5_iic_int_disable(priv);

  /* Release from the module-stop state */

  modifyreg32(RA6M5_MSTP_REG(RA6M5_MSTP_MSTPCRB_OFFSET), RA6M5_IIC_STOP(priv->bus), 0);

  /* Configure pins */

  if (ra6m5_configgpio(priv->dev->scl_pin) < 0) {
      return;
  }

  if (ra6m5_configgpio(priv->dev->sda_pin) < 0) {
      return;
  }

  /* SCLn and SDAn pins not driven - RIIC disabled */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval &= ~IIC_ICCR1_ICE;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);

  /* RIIC Reset */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval |= IIC_ICCR1_IICRST;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);

  /* Internal reset, SCLn and SDAn pins in active state */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval |= IIC_ICCR1_ICE;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);

  /* Set SARLy and SARUy */

  ra6m5_riic_putreg(priv, RA6M5_IIC_SARL0_OFFSET, RIIC_REG_INIT);
  ra6m5_riic_putreg(priv, RA6M5_IIC_SARU0_OFFSET, RIIC_REG_INIT);
  ra6m5_riic_putreg(priv, RA6M5_IIC_SARL1_OFFSET, RIIC_REG_INIT);
  ra6m5_riic_putreg(priv, RA6M5_IIC_SARU1_OFFSET, RIIC_REG_INIT);
  ra6m5_riic_putreg(priv, RA6M5_IIC_SARL2_OFFSET, RIIC_REG_INIT);
  ra6m5_riic_putreg(priv, RA6M5_IIC_SARU2_OFFSET, RIIC_REG_INIT);

  /* Set I2C bus frequency */

  ra6m5_iic_setclock(priv, priv->dev->frequency);

  /* Clear status enable register */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSER_OFFSET);
  regval &= 0x00;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICSER_OFFSET, regval);

  if (0 == priv->bus)
  {
  #ifndef CONFIG_RA6M5_IIC0_NF
    regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICFER_OFFSET);
    regval &= ~IIC_ICFER_NFE;
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICFER_OFFSET, regval);
  #else
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
    regval &= ~IIC_ICMR3_NF_MASK;
    regval |= IIC_ICMR3_NF(CONFIG_RA6M5_IIC0_NF_STAGE);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
  #endif  
  }
  else if (1 == priv->bus)
  {
  #ifndef CONFIG_RA6M5_IIC1_NF
    regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICFER_OFFSET);
    regval &= ~IIC_ICFER_NFE;
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICFER_OFFSET, regval);
  #else
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
    regval &= ~IIC_ICMR3_NF_MASK;
    regval |= IIC_ICMR3_NF(CONFIG_RA6M5_IIC1_NF_STAGE);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
  #endif  
  }
  else if (2 == priv->bus)
  {
  #ifndef CONFIG_RA6M5_IIC2_NF
    regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICFER_OFFSET);
    regval &= ~IIC_ICFER_NFE;
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICFER_OFFSET, regval);
  #else
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
    regval &= ~IIC_ICMR3_NF_MASK;
    regval |= IIC_ICMR3_NF(CONFIG_RA6M5_IIC2_NF_STAGE);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
  #endif  
  }

  /* Disable all interrupts */

  ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, RIIC_REG_INIT);

  /* Enable timeout function */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICFER_OFFSET);
  regval |= IIC_ICFER_TMOE;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICFER_OFFSET, regval);

  if (0 == priv->bus)
  {
  #ifdef CONFIG_RA6M5_IIC0_SDA_DELAY
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR2_OFFSET);
    regval |= IIC_ICMR2_DLCS;
    regval &= ~IIC_ICMR2_SDDL_MASK;
    regval |= IIC_ICMR2_SDDL(CONFIG_RA6M5_IIC0_DELAY_CNT);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR2_OFFSET, regval);
  #endif
  }
  else if (1 == priv->bus)
  {
  #ifdef CONFIG_RA6M5_IIC1_SDA_DELAY
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR2_OFFSET);
    regval |= IIC_ICMR2_DLCS;
    regval &= ~IIC_ICMR2_SDDL_MASK;
    regval |= IIC_ICMR2_SDDL(CONFIG_RA6M5_IIC1_DELAY_CNT);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR2_OFFSET, regval);
  #endif
  }
  else if (2 == priv->bus)
  {
  #ifdef CONFIG_RA6M5_IIC2_SDA_DELAY
    regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR2_OFFSET);
    regval |= IIC_ICMR2_DLCS;
    regval &= ~IIC_ICMR2_SDDL_MASK;
    regval |= IIC_ICMR2_SDDL(CONFIG_RA6M5_IIC2_DELAY_CNT);
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR2_OFFSET, regval);
  #endif
  }

  ra6m5_iic_irq_init(priv);

  /* Relese RIIC reset state */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval &= ~(IIC_ICCR1_IICRST);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);

  priv->mode = RIIC_READY;
  priv->dev_sts = RIIC_STS_IDLE;

  /* RIIC registers initialized */
}

/****************************************************************************
 * Function Name: ra6m5_iic_set_sending_data
 * Description  : Transmit Data Processing.
 *                Sets transmission data to ICDRT register.
 * Arguments    : ra6m5_i2c_priv_s *priv      ; IIC Information
 * Return Value : None
 ****************************************************************************/

static void ra6m5_iic_set_sending_data(struct ra6m5_i2c_priv_s *priv,
                                        uint8_t data)
{
  /* Sets the transmitting data. */

  ra6m5_riic_putreg(priv, RA6M5_IIC_ICDRT_OFFSET, data);
  data = ra6m5_riic_getreg(priv, RA6M5_IIC_ICDRT_OFFSET);
}

/****************************************************************************
 * Name: ra6m5_iic_advance
 *
 * Description:
 *  Check if RIIC Bus is busy
 *
 ****************************************************************************/

static void ra6m5_iic_advance(struct ra6m5_i2c_priv_s *priv)
{
  int ret;

  if ((RIIC_EV_INT_TMO == priv->event)  || (RIIC_STS_TMO == priv->dev_sts))
    {
      i2cerr("RIIC Transfer Timed Out\n");
      ra6m5_iic_timeout(priv);
    }

  if (RIIC_EV_INT_AL == priv->event)
    {
      ra6m5_iic_iicrst(priv);
    }

  if (RIIC_EV_INT_START == priv->event)
    {
      ra6m5_iic_send_slv_addr(priv);
    }

  if (RIIC_EV_INT_ADD == priv->event)
    {
      ra6m5_iic_after_send_slvadr(priv);
    }

  if (RIIC_EV_INT_SEND == priv->event)
    {
      ra6m5_iic_master_transmit(priv);
    }

