gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  if (RIIC_EV_INT_RECEIVE == priv->event)
    {
      if (RIIC_STS_RECEIVE_DATA_WAIT == priv->dev_sts)
        {
          ra6m5_iic_master_receive(priv);
        }

      else
        {
          ra6m5_iic_after_send_slvadr(priv);
        }
    }

  if (RIIC_EV_INT_NACK == priv->event)
    {
      ra6m5_iic_nack(priv);
    }

  if (RIIC_EV_INT_STOP == priv->event)
    {
      ret = ra6m5_iic_after_stop(priv);
      if (RIIC_SUCCESS == ret)
        {
          priv->mode = RIIC_FINISH;
        }
    }
}

/****************************************************************************
 * Name: ra6m5_iic_nack
 *
 * Description:
 *  NACK reception handler
 *
 ****************************************************************************/

static void ra6m5_iic_nack(struct ra6m5_i2c_priv_s *priv)
{
  ra6m5_iic_set_icier(priv, IIC_ICIER_SPIE | IIC_ICIER_ALIE);

  priv->dev_sts = RIIC_STS_SP_COND_WAIT;
  ra6m5_iic_stopcond(priv);

  if (RIIC_M_RECEIVE == priv->mode)
    {
      ra6m5_iic_read_data(priv);
    }
}

/****************************************************************************
 * Name: ra6m5_iic_timeout
 *
 * Description:
 *  After Timeout condition processing
 *
 ****************************************************************************/

static void ra6m5_iic_timeout(struct ra6m5_i2c_priv_s *priv)
{
  priv->mode = RIIC_FINISH;
}

/****************************************************************************
 * Name: ra6m5_iic_after_stop
 *
 * Description:
 *  After stop condition processing
 *
 ****************************************************************************/

static int ra6m5_iic_after_stop(struct ra6m5_i2c_priv_s *priv)
{
  int ret;
  bool bus;

  bus = ra6m5_iic_check_bus_busy(priv);

  if (bus == RIIC_BUS_BUSY)
    {
      ret = RIIC_ERR_BUS_BUSY;
    }

  else
    {
      if (RIIC_EV_INT_TMO == priv->event)
        {
          ret = RIIC_ERR_TMO;
        }

      else
        {
          ret = RIIC_SUCCESS;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: ra6m5_iic_check_bus_busy
 *
 * Description:
 *  Check if RIIC Bus is busy
 *
 ****************************************************************************/

static bool ra6m5_iic_check_bus_busy(struct ra6m5_i2c_priv_s *priv)
{
  bool bus_state = RIIC_BUS_BUSY;
  uint8_t iccr1, iccr2;
  int i;

  for (i = BUS_CHECK_COUNTER; i >= 0; i--)
    {
      iccr1 = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
      iccr2 = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET);

      if ((iccr1 & IIC_ICCR1_SDAI) && (iccr1 & IIC_ICCR1_SCLI) && !(iccr2 & IIC_ICCR2_BBSY))
        {
          bus_state = RIIC_BUS_FREE;
          break;
        }
    }

  return bus_state;
}

/****************************************************************************
 * Name: ra6m5_iic_startcond
 *
 * Description:
 *  Issue the start condition for Master transmission/reception
 *
 ****************************************************************************/

static int ra6m5_iic_startcond(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;
  int ret = RIIC_SUCCESS;
  bool bus;

  bus = ra6m5_iic_check_bus_busy(priv);

  if (bus == RIIC_BUS_FREE)
    {
      /* Clear stop */

      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
      regval &= ~(IIC_ICSR2_STOP);
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, regval);

      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
      while (0x00 != ((regval & IIC_ICSR2_START) || (regval & IIC_ICSR2_STOP)))
        {
          regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
        }

      /* Set the internal status */

      priv->dev_sts = RIIC_STS_ST_COND_WAIT;

      /* Clear ALIE bit */

      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET);
      regval &= ~(IIC_ICIER_ALIE);
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, regval);

      /* Interrupt setting */

      ra6m5_iic_set_icier(priv, IIC_ICIER_STIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

      /* Generate the start condition */

      /* Clear the start condition detection flag */

      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
      if (0x00 != ((regval & IIC_ICSR2_START) >> 2U))
        {
          /* Clears start condition detection flag. */

          regval &= ~(IIC_ICSR2_START);
          ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, regval);
          regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
        }

      /* Generate start condition */

      regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET);
      regval |= IIC_ICCR2_ST;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR2_OFFSET, regval);
      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET);
    }

  else
    {
      ret = RIIC_ERR_BUS_BUSY;
    }

  return ret;
}

/****************************************************************************
 * Name: ra6m5_iic_restartcond
 *
 * Description:
 *  Issue Re-start condition for Master Transmission/Reception
 *
 ****************************************************************************/

static void ra6m5_iic_restartcond(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;

  /* Clears start condition detection flag. */

  regval = getreg8(RA6M5_IIC_ICSR2_OFFSET);
  if (0x00 != ((regval & IIC_ICSR2_START) >> 2U))
    {
      regval &= ~(IIC_ICSR2_START);
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, regval);
    }

  /* Generates a restart condition. */

  regval = getreg8(RA6M5_IIC_ICCR2_OFFSET);
  regval |= IIC_ICCR2_RS; /* Sets ICCR2.RS bit. */
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR2_OFFSET, regval);
}

/****************************************************************************
 * Name: ra6m5_iic_send_slv_addr
 *
 * Description:
 *  Transmit slave address for communication
 *
 ****************************************************************************/

static void ra6m5_iic_send_slv_addr(struct ra6m5_i2c_priv_s *priv)
{
  uint16_t bit_addr;
  uint8_t regval;

