gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  if (priv->msgv->flags == I2C_M_TEN)
    {
      /* 10 bit slave address handling */

      bit_addr = priv->msgv->addr;
      bit_addr &= RIIC_10BIT_SARU_MASK;
      bit_addr >>= 8;
      regval = (uint8_t)bit_addr;

      ra6m5_iic_set_sending_data(priv, regval);

      /* Check ACK/NACK reception */

      bit_addr = priv->msgv->addr;
      bit_addr &= RIIC_10BIT_SARL_MASK;
      regval = (uint8_t)bit_addr;
    }

  else
    {
      if (priv->flags == I2C_M_READ)
        {
          priv->mode = RIIC_M_RECEIVE;
          ra6m5_iic_set_icier(priv, IIC_ICIER_RIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          /* 7-bit slave address with READ code */

          regval = priv->msgv->addr;
          regval <<= 1U;
          regval |= RIIC_READ_MASK;

          priv->dev_sts = RIIC_STS_SEND_SLVADR_R_WAIT;
        }

      else
        {
          priv->mode = RIIC_M_TRANSMIT;
          ra6m5_iic_set_icier(priv, IIC_ICIER_TEIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          /* 7-bit slave address with WRITE code */

          regval = priv->msgv->addr;
          regval <<= 1U;
          regval &= ~(RIIC_READ_MASK);

          priv->dev_sts = RIIC_STS_SEND_SLVADR_W_WAIT;
        }
    }

  /* Send slave address */

  ra6m5_iic_set_sending_data(priv, regval);
}

/****************************************************************************
 * Name: ra6m5_iic_after_send_slvadr
 *
 * Description:
 *  Processing after sending slave address
 *
 ****************************************************************************/

static void ra6m5_iic_after_send_slvadr(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;
  uint8_t *data;

  if (RIIC_M_TRANSMIT == priv->mode)
    {
      /* Pattern write 1: msg[0] is memory addressand msg[1] is data byte */

      if (2U >= priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;
          ra6m5_iic_set_icier(priv, IIC_ICIER_TEIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          /* Transmit first byte (memory address) */

          if (0U != priv->dcnt)
            {
              data = priv->ptr;
              regval = *data;
              ra6m5_iic_set_sending_data(priv, regval);

              priv->dcnt--;
              priv->ptr++;
            }

          else
            {
              /* Do nothing */
            }
        }

      /* Pattern write 2: msg[0] is data byte */

      else if (1U >= priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;
          ra6m5_iic_set_icier(priv, IIC_ICIER_TEIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          /* Transmit data byte */

          if (0U != priv->dcnt)
            {
              data = priv->ptr;
              regval = *data;
              ra6m5_iic_set_sending_data(priv, regval);

              priv->dcnt--;
              priv->ptr++;
            }

          else
            {
              /* Do nothing */
            }
        }

      /* Pattern write 3: transmit only slave address */

      else if (0 == priv->msgc)
        {
          priv->dev_sts = RIIC_STS_SP_COND_WAIT;
          ra6m5_iic_set_icier(priv, IIC_ICIER_SPIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          /* Generate stop condition */

          ra6m5_iic_stopcond(priv);
        }

      else
        {
          /* Do nothing */
        }
    }

  if (RIIC_M_RECEIVE == priv->mode)
    {
      priv->dev_sts = RIIC_STS_RECEIVE_DATA_WAIT;

      ra6m5_iic_set_icier(priv, IIC_ICIER_RIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

      if (2 >= priv->dcnt)
        {
          ra6m5_iic_wait_set(priv);
        }

      if (0x01 >= priv->dcnt)
        {
          ra6m5_iic_pre_end_set(priv);
        }

      /* Dummy read */

      regval = ra6m5_iic_read_data(priv);
    }
}

/****************************************************************************
 * Name: ra6m5_iic_stopcond
 *
 * Description:
 *  Issue stop condition for Master Transmission/Reception
 *
 ****************************************************************************/

static void ra6m5_iic_stopcond(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
  if (0x00 != ((regval & IIC_ICSR2_STOP) >> 3U))
    {
      regval &= ~(IIC_ICSR2_STOP);
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, regval);
      regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
    }

  /* Generates a stop condition. */

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET);
  regval |= IIC_ICCR2_SP; /* Sets ICCR2.SP bit. */
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR2_OFFSET, regval);

  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET);
}

/****************************************************************************
 * Name: ra6m5_iic_master_transmit
 *
 * Description:
 *  Transmission of data from Master to Slave
 *
 ****************************************************************************/

static void ra6m5_iic_master_transmit(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;
  uint8_t *data;

  priv->dev_sts = RIIC_STS_SEND_DATA_WAIT;

  if (0U == priv->dcnt)
    {
      /* Moving to the next message */

      priv->msgc--;

      if (0x00 == priv->msgc)
        {
          ra6m5_iic_set_icier(priv, IIC_ICIER_SPIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

          priv->dev_sts = RIIC_STS_SP_COND_WAIT;
          ra6m5_iic_stopcond(priv);
        }

      else
        {
          priv->msgv++;
          priv->ptr = priv->msgv->buffer;
          priv->flags = priv->msgv->flags;
          priv->dcnt = priv->msgv->length;

          if (priv->flags == I2C_M_READ)
            {
              priv->mode = RIIC_M_RECEIVE;
              priv->event = RIIC_EV_GEN_START_COND;

              ra6m5_iic_set_icier(priv, IIC_ICIER_STIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

              ra6m5_iic_restartcond(priv);
            }
        }
    }

  if (0U != priv->dcnt && priv->flags != I2C_M_READ)
    {
      ra6m5_iic_set_icier(priv, IIC_ICIER_TEIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

      data = priv->ptr;
      regval = *data;

