gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
      /* send the byte */

      ra6m5_iic_set_sending_data(priv, regval);

      /* decrement the count */

      priv->dcnt--;
      priv->ptr++;
    }
}

/****************************************************************************
 * Name: ra6m5_iic_read_data
 *
 * Description:
 *  Read received data from ICDRR
 *
 ****************************************************************************/

static uint8_t ra6m5_iic_read_data(struct ra6m5_i2c_priv_s *priv)
{
  return ra6m5_riic_getreg(priv, RA6M5_IIC_ICDRR_OFFSET);;
}

/****************************************************************************
 * Name: ra6m5_iic_wait_set
 *
 * Description:
 *  Receive "last byte - 2bytes" Setting Proccesing.
 *  Sets ICMR3.WAIT bit.
 *
 ****************************************************************************/

static void ra6m5_iic_wait_set(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t enab = 0;

  if (0 == priv->bus)
    {
#ifdef CONFIG_RA6M5_IIC0_RCV_IN_BYTE_UNITS
      enab = 1;
#endif
    }

  else if (1 == priv->bus)
    {
#ifdef CONFIG_RA6M5_IIC1_RCV_IN_BYTE_UNITS
      enab = 1;
#endif
    }

  else
    {
#ifdef CONFIG_RA6M5_IIC2_RCV_IN_BYTE_UNITS
      enab = 1;
#endif
    }

  if (enab) 
  {
    uint8_t regval;
    regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
    regval |= IIC_ICMR3_WAIT;
    ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
    regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
  }
}

/****************************************************************************
 * Name: ra6m5_iic_pre_end_set
 *
 * Description:
 *  Receive "last byte - 1byte" Setting Processing.
 *  Sets ICMR3.RDRFS bit and ACKBT bit.
 *
 ****************************************************************************/

static void ra6m5_iic_pre_end_set(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);

#ifdef CONFIG_RA6M5_IIC0_RCV_IN_BYTE_UNITS
  /* Set the RDRF flag on the rising edge of the 8th SCL clock cycle */
  regval |= IIC_ICMR3_RDRFS;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
#endif
  
  /* Write enable ACKBT bit */
  regval |= IIC_ICMR3_ACKWP;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

  /* Send 1 as the acknowledge bit  */
  regval |= IIC_ICMR3_ACKBT;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

  /* Write disable ACKBT bit */
  regval &= ~IIC_ICMR3_ACKWP;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

  /* Read back */
  ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
}

/****************************************************************************
 * Name: ra6m5_iic_end_set
 *
 * Description:
 *  Receive End Setting Processing.
 *  Sets ICMR3.ACKBT bit and clears ICMR3.WAIT bit.
 *
 ****************************************************************************/

static void ra6m5_iic_end_set(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);

  /* Write enable ACKBT bit */
  regval |= IIC_ICMR3_ACKWP;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

  /* Send 1 as the acknowledge bit  */
  regval |= IIC_ICMR3_ACKBT;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

  /* Write disable ACKBT bit */
  regval &= ~IIC_ICMR3_ACKWP;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);

#ifdef CONFIG_RA6M5_IIC0_RCV_IN_BYTE_UNITS
  /* No wait ( */
  regval &= ~IIC_ICMR3_WAIT;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, regval);
#endif

  /* Read back */
  ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
}

/****************************************************************************
 * Name: ra6m5_iic_master_receive
 *
 * Description:
 *  Transmission of data from Master to Slave
 *
 ****************************************************************************/

static void ra6m5_iic_master_receive(struct ra6m5_i2c_priv_s *priv)
{
  uint8_t regval;
  priv->dev_sts = RIIC_STS_RECEIVE_DATA_WAIT;

  /* The period between the ninth clock cycle and the first clock cycle
   * is held low. Low-hold is released by reading the ICDRR register.
   */

  if (0x03 >= priv->dcnt)
    {
      ra6m5_iic_wait_set(priv);
    }

  if (0x02 >= priv->dcnt)
    {
      ra6m5_iic_pre_end_set(priv);
    }

  if (0x01 >= priv->dcnt)
    {
      ra6m5_iic_set_icier(priv, IIC_ICIER_SPIE | IIC_ICIER_NAKIE | IIC_ICIER_ALIE);

      priv->dev_sts = RIIC_STS_SP_COND_WAIT;
      ra6m5_iic_stopcond(priv);

      if (0x00 != priv->dcnt)
        {
          regval = ra6m5_iic_read_data(priv);
          *(priv->msgv->buffer) = regval;
          priv->msgv->buffer++;
          *(priv->ptr) = regval;
          priv->dcnt--;
        }

      else
        {
          regval = ra6m5_iic_read_data(priv);
        }

      ra6m5_iic_end_set(priv);
    }

  else
    {
      regval = ra6m5_iic_read_data(priv);
      *(priv->msgv->buffer) = regval;
      priv->msgv->buffer++;
      *(priv->ptr) = regval;
      priv->dcnt--;
    }
}

/****************************************************************************
 * Name: ra6m5_iic_rxi_isr
 *
 * Description:
 *  Interrupt RXI handler – Received Data Full Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed in Master Receive Mode
 *  - Reception of (last data – 1) completed in Master Receive Mode
 *  - Reception of last data completed in Master Receive Mode
 *
 ****************************************************************************/

static int ra6m5_iic_rxi_isr(int irq, void *context, void *arg)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)arg;

  priv->event = RIIC_EV_INT_RECEIVE;

  ra6m5_iic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_iic_txi_isr
 *
 * Description:
 *  Interrupt TEI handler – Transmit Data Empty Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Transmit Buffer is empty
 *
 ****************************************************************************/

static int ra6m5_iic_txi_isr(int irq, void *context, void *arg)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)arg;

  /* Ideally, should never get here as this interrupt only occurs during
   * Multi-master mode of operation and
   * Slave transmission/recption mode
   */

  priv->event = RIIC_EV_INT_TXI;

  ra6m5_iic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_iic_tei_isr
 *
 * Description:
 *  Interrupt TEI handler – Transmission End Interrupt Handler
 *
 * Occurs under following conditions:
 *  - Address/data transmission completed
 *
 ****************************************************************************/

static int ra6m5_iic_tei_isr(int irq, void *context, void *arg)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)arg;
  uint8_t regval;

