gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  /* Clear the TEND flag */
  regval  = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
  regval &= ~IIC_ICSR2_TEND;
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, regval);

  while (ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET) & IIC_ICSR2_TEND)
    {
      /* Do Nothing */
    }

  if ((RIIC_STS_SEND_SLVADR_W_WAIT == priv->dev_sts) ||
     (RIIC_STS_SEND_SLVADR_R_WAIT == priv->dev_sts))
    {
      /* Sets interrupted address sending - slave address transmitted */

      priv->event = RIIC_EV_INT_ADD;
    }

  else if (RIIC_STS_SEND_DATA_WAIT == priv->dev_sts)
    {
      /* Sets interrupted data sending */

      priv->event = RIIC_EV_INT_SEND;
    }

  ra6m5_iic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_iic_eri_isr
 *
 * Description:
 *  Interrupt ERI handler – Event/Error Generation Interrupt Handler
 *
 * Occurs under following conditions:
 *  - START condition detected
 *  - RESTART condition detected
 *  - STOP condition detected
 *  - NACK detected
 *  - AL (arbitration-lost) detected
 *  - TMO (timeout detection)
 *
 ****************************************************************************/

static int ra6m5_iic_eri_isr(int irq, void *context, void *arg)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)arg;
 
  /* Get the status flag */
  uint8_t stat = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);

  /* Get the interrupt enable flag */
  uint8_t enab = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET);

  /* Check Timeout Condition */

  if ((stat & IIC_ICSR2_TMOF) && (enab & IIC_ICIER_TMOIE))
    {
      /* Disable the Timeout Interrupt */

      enab &= ~IIC_ICIER_TMOIE;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      while ((enab = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET)) & IIC_ICIER_TMOIE)
        {
          /* Wait for reset to complete */
        }

      priv->event = RIIC_EV_INT_TMO;
    }

  /* Check Arbitration-Lost Condition */

  if ((stat & IIC_ICSR2_AL) && (enab & IIC_ICIER_ALIE))
    {
      /* Disable the Arbitration-Lost Interrupt */

      enab &= ~IIC_ICIER_ALIE;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      while ((enab = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET)) & IIC_ICIER_ALIE)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_AL;
    }

  /* Check Stop Condition */

  if ((stat & IIC_ICSR2_STOP) && (enab & IIC_ICIER_SPIE))
    {
      /* Disable Stop Condition Detection Interrupt */

      enab &= ~IIC_ICIER_SPIE;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      /* Clear RDRFS, ACKBT */

      uint8_t icmr3 = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
      icmr3 &= IIC_ICMR3_RDRFS;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, icmr3);

      icmr3 |= IIC_ICMR3_ACKWP;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, icmr3);

      icmr3 &= ~IIC_ICMR3_ACKBT;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, icmr3);

      icmr3 &= ~IIC_ICMR3_ACKWP;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICMR3_OFFSET, icmr3);

      /* Wait for done */
      do
      {
        icmr3 = ra6m5_riic_getreg(priv, RA6M5_IIC_ICMR3_OFFSET);
      } while (icmr3 & (IIC_ICMR3_RDRFS | IIC_ICMR3_ACKBT));
      

      /* Clear Stop Condition Detection */

      stat &= ~IIC_ICSR2_STOP;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, stat);

      while ((stat = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET)) & IIC_ICSR2_STOP)
        {
          /* Do Nothing */
        }

      priv->event = RIIC_EV_INT_STOP;
    }

  /* Check NACK reception. */

  if ((stat & IIC_ICSR2_NACKF) && (enab & IIC_ICIER_NAKIE))
    {
      /* Prohibits NACK interrupt to generate stop condition. */

      enab &= ~IIC_ICIER_NAKIE;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      /* Prohibits these interrupt.
       * After NACK interrupt, these interrupts will occur
       * when they do not stop the following interrupts.
       */

      enab &= ~ (IIC_ICIER_TEIE | IIC_ICIER_TIE | IIC_ICIER_RIE);
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      /* Wait for done */
      do
      {
        enab = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET);
      } while (enab & (IIC_ICIER_TEIE | IIC_ICIER_TIE | IIC_ICIER_RIE));

      if (!(ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET) & IIC_ICCR2_TRS))
        {
          //IR(RIIC0, RXI0) = 0;
        }

      priv->event = RIIC_EV_INT_NACK;
    }

  /* Check Start condition detection. */

  if ((stat & IIC_ICSR2_START) && (enab & IIC_ICIER_STIE))
    {
      /* Disable Start Condition Detection Interrupt. */

      enab &= ~IIC_ICIER_STIE;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICIER_OFFSET, enab);

      /* Clear Start Condition Detection */

      stat &= ~IIC_ICSR2_START;
      ra6m5_riic_putreg(priv, RA6M5_IIC_ICSR2_OFFSET, stat);

      /* Wait till reset is completed */
      do 
      {
        stat = ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET);
        enab = ra6m5_riic_getreg(priv, RA6M5_IIC_ICIER_OFFSET);

      } while ((stat & IIC_ICSR2_START) || (enab & IIC_ICIER_STIE));

      /* Sets event flag. */

      priv->event = RIIC_EV_INT_START;
    }

  ra6m5_iic_advance(priv);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_i2c_transfer
 *
 * Description:
 *   This function initializes the RIIC channel
 *
 ****************************************************************************/

static int ra6m5_i2c_transfer(struct i2c_master_s *dev,
                              struct i2c_msg_s *msgs, int count)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)dev;
  int ret = 0;

  DEBUGASSERT(dev != NULL && msgs != NULL && count > 0);

  /* Get exclusive access to the I2C bus */

  nxmutex_lock(&priv->lock);

  priv->mode = RIIC_READY;
  priv->dev_sts = RIIC_STS_IDLE;
  priv->event = RIIC_EV_NONE;

  priv->dcnt = 0;
  priv->ptr = NULL;

