gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_iic.c
  priv->msgv = msgs;
  priv->msgc = count;

  priv->ptr = priv->msgv->buffer;
  priv->dcnt = priv->msgv->length;
  priv->flags = priv->msgv->flags;

  /* Set reference clock for I2C bus */

  ra6m5_iic_setclock(priv, msgs->frequency);

  if ((priv->flags == 0) || (priv->flags == I2C_M_NOSTOP)
     || (priv->flags == I2C_M_TEN))
    {
      /* MASTER TRANSMISSION MODE
       * No communication is in progress
       * Initiate START condition and proceed with transfer
       */

      if (priv->mode == RIIC_READY)
        {
          /* Device is ready for communication */

          priv->event = RIIC_EV_GEN_START_COND;
          ret = ra6m5_iic_startcond(priv);
          if (ret == RIIC_ERR_BUS_BUSY)
            {
              priv->mode = RIIC_NONE;
              priv->dev_sts = RIIC_STS_NO_INIT;
              priv->event = RIIC_EV_NONE;

              /* Disable interrupts */

              ra6m5_iic_int_disable(priv);
            }
        }
    }

  else if (priv->flags == I2C_M_READ)
    {
      /* MASTER RECEPTION MODE
       * No communication is in progress
       * Initiate START condition and proceed with transfer
       */

      if (priv->mode == RIIC_READY)
        {
          /* Device is ready for communication */

          priv->event = RIIC_EV_GEN_START_COND;
          ret = ra6m5_iic_startcond(priv);
          if (ret == RIIC_ERR_BUS_BUSY)
            {
              priv->mode = RIIC_NONE;
              priv->dev_sts = RIIC_STS_NO_INIT;
              priv->event = RIIC_EV_NONE;

              /* Disable interrupts */

              ra6m5_iic_int_disable(priv);
            }
        }
    }

  else if (priv->flags == I2C_M_NOSTART)
    {
      /* COMMUNICATION IS IN PROGRESS */

      if (priv->mode == RIIC_M_TRANSMIT)
        {
          priv->ptr = priv->msgv->buffer;
          priv->dcnt = priv->msgv->length;
          ra6m5_iic_master_transmit(priv);
        }

      else if (priv->mode == RIIC_M_RECEIVE)
        {
          ra6m5_iic_master_receive(priv);
        }
    }

  nxmutex_unlock(&priv->lock);

  while (RIIC_FINISH != priv->mode && RIIC_NONE != priv->mode);

  if (ra6m5_riic_getreg(priv, RA6M5_IIC_ICSR2_OFFSET) & IIC_ICSR2_NACKF)
    {
      ret = -ENXIO;
    }

  else if ((ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR2_OFFSET) & IIC_ICCR2_BBSY) || (RIIC_ERR_BUS_BUSY == ret))
    {
      ret = -EBUSY;
    }

  else
    {
      ret = RIIC_SUCCESS;
    }

  ra6m5_iic_iicrst(priv);
  return ret;
}

/****************************************************************************
 * Name: ra6m5_i2c_reset
 *
 * Description:
 *   Resets the RIIC channel
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int ra6m5_i2c_reset(struct i2c_master_s *dev)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)dev;
  uint8_t regval;

  DEBUGASSERT(dev);

  DEBUGASSERT(priv->refs > 0);

  nxmutex_lock(&priv->lock);

  /* Assert the Internal Reset */
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval |= IIC_ICCR1_IICRST; 
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);

  /* Release the Internal Reset */
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);
  regval &= ~(IIC_ICCR1_IICRST);
  ra6m5_riic_putreg(priv, RA6M5_IIC_ICCR1_OFFSET, regval);
  regval = ra6m5_riic_getreg(priv, RA6M5_IIC_ICCR1_OFFSET);

  nxmutex_unlock(&priv->lock);
  return OK;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Name: ra6m5_i2cbus_initialize
 *
 * Description:
 *   This function initializes the RIIC channel
 *
 ****************************************************************************/

struct i2c_master_s *ra6m5_i2cbus_initialize(int channel)
{
  struct ra6m5_i2c_priv_s *priv = NULL;

  /* Get I2C private structure */

  i2cinfo("RA6M5 RIIC Bus Initialization:\n");

  switch (channel)
    {
#ifdef CONFIG_RA6M5_IIC0
      case 0:
        priv = (struct ra6m5_i2c_priv_s *)&ra6m5_iic0_priv;
        i2cinfo("RA6M5 RIIC0 Channel Initial Setup\n");
        break;
#endif
#ifdef CONFIG_RA6M5_IIC1
      case 1:
        priv = (struct ra6m5_i2c_priv_s *)&ra6m5_iic1_priv;
        i2cinfo("RA6M5 RIIC1 Channel Initial Setup\n");
        break;
#endif
#ifdef CONFIG_RA6M5_IIC2
      case 2:
        priv = (struct ra6m5_i2c_priv_s *)&ra6m5_iic2_priv;
        i2cinfo("RA6M5 RIIC2 Channel Initial Setup\n");
        break;
#endif
      default:
        i2cerr("Channel %d is not supported by RA6M5\n", channel);
        return NULL;
    }

  /* Initialize private data for the first time, increment reference count,
   * initialize RIIC registers and attach IRQs
   */

  nxmutex_lock(&priv->lock);

  if (priv->refs++ == 0)
    {
      /* Initialize the RIIC registers */

      ra6m5_iic_init(priv);
    }

  nxmutex_unlock(&priv->lock);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: ra6m5_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialize an RIIC device
 *
 ****************************************************************************/

int ra6m5_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct ra6m5_i2c_priv_s *priv = (struct ra6m5_i2c_priv_s *)dev;

  DEBUGASSERT(dev);

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  /* Unconfigure GPIO pins */

  ra6m5_unconfiggpio(priv->dev->scl_pin);
  ra6m5_unconfiggpio(priv->dev->sda_pin);

  /* Disable power and other HW resource (GPIO's) */

  ra6m5_iic_int_disable(priv);

  irq_detach(priv->dev->txi_irq);
  irq_detach(priv->dev->rxi_irq);
  irq_detach(priv->dev->tei_irq);
  irq_detach(priv->dev->eri_irq);

  nxmutex_unlock(&priv->lock);
  return OK;
}

#endif /* CONFIG_RA6M5_IIC0 || CONFIG_RA6M5_IIC1 || CONFIG_RA6M5_IIC2 */
